applications/testcases/parcelStressModelling/CFD/0/rho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 2.28; //1.3;

boundaryField
{

    patch0_half0
    {
        type            cyclic;
    }
    patch1_half0
    {
        type            cyclic;
    }
    patch2_half0
    {
        type            cyclic;
    }
    patch2_half1
    {
        type            cyclic;
    }
    patch1_half1
    {
        type            cyclic;
    }
    patch0_half1
    {
        type            cyclic;
    }

}

// ************************************************************************* //
